app/controllers/decisions_controller.rb

SELECT * FROM "decisions"
---
  def index
    @decisions = Decision.all

SELECT * FROM "decisions" WHERE ("decisions"."id" = 1)
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def show
    @decision = Decision.find(params[:id])
	@project = Project.find(params[:project_id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def new
#    @decision = Decision.new
	@project = Project.find(params[:project_id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "decision_types" WHERE ("decision_types"."id" = 0)
INSERT INTO "decisions" ("result", "created_at", "expiration_date", "project_id", "updated_at", "decision_type_id", "creator_user_id", "summary", "description") VALUES(NULL, '2009-11-02 23:37:46', NULL, NULL, '2009-11-02 23:37:46', 8, NULL, NULL, NULL)
---
  def create
  	# NB: this shouldn't get called -- the specific decision type controllers should get called

	# TODO: fix me
	@current_user_id = 1

    @decision = Decision.new(
    	params[:decision].merge({
    		creator_user_id => @creator_user_id
    	})
    )
	@project = Project.find(params[:project_id])

	respond_to do |format|
		#if params[:decision_type_id].nil?
		if @decision.decision_type_id.nil?
			format.html { render :action => "new" }
			format.xml  { render :xml => @decision.errors, :status => :unprocessable_entity }
		else
			decision_type_text_id = DecisionType.find(@decision.decision_type).text_id
			decision_type = decision_type_text_id.camelize
			@decision_detail = eval(decision_type + "Decision.new")

			if @decision_detail.summary
				if @decision.save && @decision_detail.save