app/controllers/expand_share_pool_decisions_controller.rb

SELECT * FROM "decisions" WHERE ("decisions".decidable_id = 2 AND "decisions".decidable_type = 'ExpandSharePoolDecision') LIMIT 1
SELECT * FROM "expand_share_pool_decisions" WHERE ("expand_share_pool_decisions"."id" = 2)
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "shareholders" WHERE ("shareholders"."project_id" = 1 AND "shareholders"."user_id" = 1) LIMIT 1
SELECT * FROM "votes" WHERE ("votes"."shareholder_id" = 1 AND "votes"."decision_id" = 30) LIMIT 1
SELECT * FROM "votes" WHERE ("votes"."user_id" = 1 AND "votes"."decision_id" = 31) LIMIT 1
---
  def show
	# TODO: fix me
	@current_user_id = 1

    @expand_share_pool_decision = ExpandSharePoolDecision.find(params[:id])
    @decision = @expand_share_pool_decision.decision
	@project = Project.find(params[:project_id])
    shareholder = Shareholder.find_by_user_id_and_project_id( @current_user_id, @decision.project_id )

	@my_vote = Vote.find_by_decision_id_and_shareholder_id(@decision.id, shareholder)
	@all_votes = Vote.find_all_by_decision_id(@decision.id)