app/controllers/general_multiple_choice_decisions_controller.rb

  def new
	  @general_multiple_choice_decision = GeneralMultipleChoiceDecision.new
	  @decision = Decision.new
	  @project = Project.find(params[:project_id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def create
	# TODO: fix me
	@current_user_id = 1

	@project = Project.find(params[:project_id])
    @general_multiple_choice_decision = GeneralMultipleChoiceDecision.new(params[:general_multiple_choice_decision])
    @general_multiple_choice_decision.decision = Decision.new(
    	params[:decision].merge(
    		:project_id => @project.id,
    		:creator_user_id => @current_user_id
    	)
    )

	respond_to do |format|
		if @general_multiple_choice_decision.save
			n = 1
			while !params["option" + n.to_s].nil? and params["option" + n.to_s] != ""
				multiple_choice_option = MultipleChoiceOption.new(
					:general_multiple_choice_decision_id => @general_multiple_choice_decision.id,
					:option => params["option" + n.to_s]
				)
				n = n + 1
				multiple_choice_option.save
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "decisions" ("result", "expiration_date", "created_at", "project_id", "updated_at", "decidable_id", "decidable_type", "creator_user_id", "summary") VALUES(NULL, NULL, '2009-11-09 11:34:07', 1, '2009-11-09 11:34:07', 1, 'GeneralMultipleChoiceDecision', NULL, '')
INSERT INTO "general_multiple_choice_decisions" ("created_at", "updated_at", "question") VALUES('2009-11-09 11:34:07', '2009-11-09 11:34:07', NULL)
INSERT INTO "multiple_choice_options" ("option", "created_at", "updated_at", "general_multiple_choice_decision_id") VALUES(NULL, '2009-11-09 11:34:07', '2009-11-09 11:34:07', 1)

  def show
	# TODO: fix me
	@current_user_id = 1

    @general_multiple_choice_decision = GeneralMultipleChoiceDecision.find(params[:id])
    @decision = @general_multiple_choice_decision.decision
	@project = Project.find(params[:project_id])

	@multiple_choice_options = MultipleChoiceOption.find_all_by_general_multiple_choice_decision_id( @general_multiple_choice_decision.id );

	shareholder = Shareholder.find_by_user_id_and_project_id( @current_user_id, @decision.project_id )
	@my_vote = Vote.find_by_decision_id_and_shareholder_id(@decision.id, shareholder)
	@vote = Vote.new
	@all_votes = Vote.find_all_by_decision_id(@decision.id)
---
SELECT * FROM "decisions" WHERE ("decisions".decidable_id = 5 AND "decisions".decidable_type = 'GeneralMultipleChoiceDecision') LIMIT 1
SELECT * FROM "general_multiple_choice_decisions" WHERE ("general_multiple_choice_decisions"."id" = 5)
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "multiple_choice_options" WHERE ("multiple_choice_options"."general_multiple_choice_decision_id" = 5)
SELECT * FROM "votes" WHERE ("votes"."user_id" = 1 AND "votes"."decision_id" = 26) LIMIT 1