app/controllers/general_yes_no_decisions_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def new
	  @general_yes_no_decision = GeneralYesNoDecision.new
	  @decision = Decision.new
	  @project = Project.find(params[:project_id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "decisions" ("result", "expiration_date", "created_at", "project_id", "updated_at", "decidable_id", "decidable_type", "creator_user_id", "summary") VALUES(NULL, NULL, '2009-11-09 01:14:41', NULL, '2009-11-09 01:14:41', 5, 'GeneralYesNoDecision', NULL, '6467')
INSERT INTO "general_yes_no_decisions" ("created_at", "updated_at", "description") VALUES('2009-11-09 01:11:28', '2009-11-09 01:11:28', 'athat')
---
  def create
	# TODO: fix me
	@current_user_id = 1

	@project = Project.find(params[:project_id])
    @general_yes_no_decision = GeneralYesNoDecision.new(params[:general_yes_no_decision])
    @general_yes_no_decision.decision = Decision.new(
    	params[:decision].merge(
    		:project_id => @project.id,
    		:creator_user_id => @current_user_id
    	)
    )

	respond_to do |format|
		if @general_yes_no_decision.save

SELECT * FROM "decisions" WHERE ("decisions".decidable_id = 13 AND "decisions".decidable_type = 'GeneralYesNoDecision') LIMIT 1
SELECT * FROM "general_yes_no_decisions" WHERE ("general_yes_no_decisions"."id" = 13)
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "votes" WHERE ("votes"."user_id" IS NULL AND "votes"."decision_id" = 24) LIMIT 1
---
  def show
	# TODO: fix me
	@current_user_id = 1

    @general_yes_no_decision = GeneralYesNoDecision.find(params[:id])
    @decision = @general_yes_no_decision.decision
	@project = Project.find(params[:project_id])
	shareholder = Shareholder.find_by_user_id_and_project_id( @current_user_id, @decision.project_id )
	@my_vote = Vote.find_by_decision_id_and_shareholder_id(@decision.id, shareholder.id)
	@all_votes = Vote.find_all_by_decision_id(@decision.id)