app/controllers/projects_controller.rb

SELECT * FROM "projects"
---
  def index
    @projects = Project.all

SELECT * FROM "projects" WHERE ("projects"."id" = 0)
SELECT * FROM "shareholders" WHERE ("shareholders".project_id = 1)
SELECT * FROM "tasks" WHERE ("tasks"."task_status_id" = 1 AND "tasks"."project_id" = 1 AND "tasks"."offered_or_wanted" = 'wanted')
---
  def show
    @project = Project.find(params[:id])

    task_status_id = 1 # TaskStatus.new("not started or in progress";

	session_user_id = 1
	if @project.shareholders.map{ |user| user.id }.include?(session_user_id)
		@user_is_a_shareholder = true
	end

    # can we base this off @project?
    @current_work_wanted = Task.find(
		:all,
		:conditions => {
			:project_id => @project.id,
			:task_status_id => task_status_id,
			:offered_or_wanted => "wanted"
		}
    )
    @current_work_offered = Task.find(
		:all,
		:conditions => {
			:project_id => @project.id,
			:task_status_id => task_status_id,

SELECT * FROM "decisions" WHERE ("decisions"."project_id" = 1 AND "decisions"."result" IN ('!=',''))
---
	}
    )

    @current_decisions = Decision.find(
		:all,
		:conditions => {
			:project_id => @project.id,
			:result => nil
		}
    )

INSERT INTO "projects" ("name", "created_at", "updated_at", "total_shares", "description", "summary") VALUES('Syncopatica', '2010-05-26 11:22:52', '2010-05-26 11:22:52', 100000, 'because', NULL)
---
  def create
	  @current_user_id = 1 # TODO: fix me

    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save