app/controllers/shareholders_controller.rb

SELECT * FROM "shareholders" WHERE ("shareholders"."project_id" = '1') LIMIT 1
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def index
    @shareholders = Shareholder.find_all_by_project_id(params[:project_id])
    @project = Project.find(params[:project_id])

SELECT * FROM "shareholders" WHERE ("shareholders"."project_id" = '1' AND "shareholders"."id" = '1') LIMIT 1
---
  def show
    @shareholder = Shareholder.find_by_id_and_project_id(params[:id], params[:project_id])