app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT * FROM "tasks"

  def show
    @project = Project.find(params[:project_id])
    @task = Task.find(params[:id])

	@current_user_id = 1 # TODO: fix me
	@can_mark_as_abandoned = @task.requester_user_id == @current_user_id || @task.performer_user_id == @current_user_id
	@performer_not_yet_decided = @task.performer_user_id == 0
	@ready_to_decide_performer = 0 # TODO: fix me @task.
	@shares_available = self.get_shares_available( @project.id, @current_user_id )

	# always assume a new task_share; updating existing ones will delete previous ones
	@task_share = TaskShare.new( :task_id => @task.id )

	@all_task_shares = TaskShare.find_all_by_task_id( @task.id )

	@expand_share_pool_decision = ExpandSharePoolDecision.find_by_task_id( @task.id )
	@vote = Vote.new
	if ! @expand_share_pool_decision.nil?
		#@expand_share_pool_votes = Vote.find_all_by_decision_id( @expand_share_pool_decision.decision.id )
		@expand_share_pool_votes = @expand_share_pool_decision.decision.votes
	end

	if ! @task.decisions.nil? and ! @task.decisions.first.nil?
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
SELECT * FROM "task_shares" WHERE ("task_shares"."user_id" = 1 AND "task_shares"."task_id" = -612274478) LIMIT 1
SELECT * FROM "expand_share_pool_decisions" WHERE ("expand_share_pool_decisions"."task_id" = 2) LIMIT 1
SELECT * FROM "decisions" INNER JOIN "decisions_tasks" ON "decisions".id = "decisions_tasks".decision_id WHERE ("decisions_tasks".task_id = 33 ) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def new
	@current_user_id = 1 # TODO: fix me

    @project = Project.find(params[:project_id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def create
    # TODO: can this user create this task?
	@current_user_id = 1 # TODO: fix me

    @project = Project.find(params[:project_id])

	# make sure this user has the requested number of shares available
	@shares_available = self.get_shares_available( @project.id, @current_user_id )

	num_shares = params[:task][:num_shares]

	if (params[:task][:offered_or_wanted] == "wanted" \
		&& !num_shares.nil? \
		&& @shares_available < num_shares.to_i)
		#@task.errors.push("You only have " + @shares_available + " shares available to offer for tasks")
	end

    @task = Task.new(
		params[:task].merge({
			:requester_user_id => @current_user_id,
			:performer_user_id => params[:task][:offered_or_wanted] == "offered" ? @current_user_id : 0,
			:project_id => @project.id,
			:task_status_id => 1, # TODO: don't hardcode me
			:num_shares => num_shares
		})
    )

	@task.save # TODO: check for errors
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "tasks" ("name", "days_to_complete", "created_at", "project_id", "requester_user_id", "updated_at", "task_status_id", "num_shares", "offered_or_wanted", "description", "performer_user_id") VALUES('awef', 3, '2009-10-27 02:05:35', NULL, NULL, '2009-10-27 02:05:35', NULL, 4, 'offered', 'awef', NULL)

  def update
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 28)