app/controllers/task_shares_controller.rb

DELETE FROM "task_shares" WHERE "id" = 5
SELECT * FROM "tasks" WHERE ("tasks"."id" = 2)
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "task_shares" ("task_id", "created_at", "updated_at", "user_id", "num_shares") VALUES(NULL, '2009-12-22 23:16:40', '2009-12-22 23:16:40', NULL, 4)
---
  def create
  	@current_user_id = 1 # TODO: fix me

	# remove any existing entries
	TaskShare.destroy_all( :task_id => params[:task_share][:task_id], :user_id => @current_user_id )

    @task_share = TaskShare.new(
    	params[:task_share].merge({
    		:user_id => @current_user_id
		})
    )
	@task = Task.find(@task_share.task_id)
	@project = Project.find(@task.project_id)

    respond_to do |format|
      if @task_share.save

SELECT * FROM "task_shares" WHERE ("task_shares"."id" = 8)
UPDATE "task_shares" SET "updated_at" = '2009-12-24 20:10:22', "num_shares" = 30 WHERE "id" = 8
---
  def update
    @task_share = TaskShare.find(params[:id])

    respond_to do |format|
      if @task_share.update_attributes(params[:task_share])

SELECT * FROM "task_shares" WHERE ("task_shares"."id" = 6)
SELECT * FROM "tasks" WHERE ("tasks"."id" = 2)
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
DELETE FROM "task_shares" WHERE "id" = 6
---
  def destroy
    @task_share = TaskShare.find(params[:id])

	@task = Task.find(@task_share.task_id)
	@project = Project.find(@task.project_id)

    @task_share.destroy