app/controllers/text_change_decisions_controller.rb

  def new
      @text_change_decision = TextChangeDecision.new( :target_field => params[:target_field] )
      @decision = Decision.new
      @project = Project.find(params[:project_id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def create
    # TODO: add creator_user_id, project_id
    @project = Project.find(params[:project_id])
    @text_change_decision = TextChangeDecision.new(params[:text_change_decision])
    @text_change_decision.decision = Decision.new(
        params[:decision].merge(
            :project_id => @project.id
        )
    )

    respond_to do |format|
        if @text_change_decision.save
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "decisions" ("result", "expiration_date", "created_at", "project_id", "updated_at", "decidable_id", "decidable_type", "creator_user_id", "summary") VALUES(NULL, NULL, '2009-11-09 21:28:11', 1, '2009-11-09 21:28:11', 1, 'TextChangeDecision', NULL, 'sum')
INSERT INTO "text_change_decisions" ("created_at", "target_field", "updated_at", "target_value") VALUES('2009-11-09 21:28:11', NULL, '2009-11-09 21:28:11', 'new name')