app/controllers/user_collections_controller.rb

SELECT * FROM "user_collections" WHERE ("user_collections"."id" = 2)
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "decisions" INNER JOIN "decisions_user_collections" ON "decisions".id = "decisions_user_collections".decision_id WHERE ("decisions_user_collections".user_collection_id = 4 ) LIMIT 1
SELECT * FROM "tasks" INNER JOIN "decisions_tasks" ON "tasks".id = "decisions_tasks".task_id WHERE ("decisions_tasks".decision_id = 38 ) LIMIT 1
SELECT * FROM "users" INNER JOIN "user_collections_users" ON "users".id = "user_collections_users".user_id WHERE ("user_collections_users".user_collection_id = 4 )
---
  def update
    user_collection = UserCollection.find(params[:id])
    add_user_id = User.find(params[:add_user_id])

	if ! user_collection.users.grep add_user_id
		user_collection.users.push( add_user_id ) # TODO: assume current_user_id, or make hack-proof
	end

	@task = user_collection.decisions.first.tasks.first