app/controllers/votes_controller.rb

  def create
	# TODO: fix me
	@current_user_id = 1
	@decision = Decision.find(params[:decision_id])
	shareholder = Shareholder.find_by_user_id_and_project_id( @current_user_id, @decision.project_id )

	Vote.destroy_all( :decision_id => params[:decision_id], :shareholder_id => shareholder )

	@project = Project.find(@decision.project_id)
    @vote = Vote.new(
    	:decision_id => @decision.id,
    	:choice      => params[:choice],
#		:user_id     => @current_user_id
		:shareholder_id => shareholder.id,
		:num_shares  => shareholder.num_shares # this can change over time, so we want to record the present num_shares
	)

	# TODO:
	# @decision.attempt_to_finalize # except @decision is the model object, not the controller, so...
	# DecisionController.attempt_to_finalize(@decision)?
	# or does that belong in the model?

	respond_to do |format|
		if @vote.save
---
SELECT * FROM "decisions" WHERE ("decisions"."id" = 31)
SELECT * FROM "shareholders" WHERE ("shareholders"."project_id" = 1 AND "shareholders"."user_id" = 1) LIMIT 1
DELETE FROM "votes" WHERE "id" = 4
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "votes" ("created_at", "choice", "updated_at", "decision_id", "shareholder_id", "num_shares") VALUES('2010-03-17 21:46:46', '1', '2010-03-17 21:46:46', 38, 1, 100000)